literate/StepwiseMachine.org
#+TITLE: Stepwise Interpreter Machine
#+PROPERTY: header-args    :comments both :tangle ../src/StepwiseMachine.js

This XState Machine will interpret Concrete programs in a step-wise fashion, that is it will take only minimal steps forward each time it receives a =step= event from its parent. Its purpose is to facilitate step-wise debugging. To run a program continuously, a parent machine should invoke this and keep sending =step= events until the interpreter halts or errs.

* Preamble

#+begin_src js
import { Machine, sendParent, send } from "xstate";
import { assign } from "@xstate/immer";
import {immerable} from "immer";
import { Frame } from "./Frame";
import { Category } from "concrete-parser";
import { service as callUserTapeExecutorService } from "./executors/callUserTape";
const MAX_STEPS = 10000;
#+end_src

