src/StepwiseMachine.js
// Preamble


// [[file:../literate/StepwiseMachine.org::*Preamble][Preamble:1]]
import { Machine, sendParent, send } from "xstate";
import { assign } from "@xstate/immer";
import {immerable} from "immer";
import { Frame } from "./Frame";
import { Category } from "concrete-parser";
import { service as callUserTapeExecutorService } from "./executors/callUserTape";
const MAX_STEPS = 10000;
// Preamble:1 ends here

// Definition
