literate/StepwiseMachine.org
* Definition

Begin the definition, we'll explain each state in turn:

#+begin_src js
export const definition = {
    id: "StepwiseInterpreter",
    strict: true,
#+end_src

At any time until the interpreter finalizes, users can load new global implementations.

#+begin_src js
    on: {
        LOAD_GLOBAL_LABEL: { actions: [ "loadGlobalLabel" ] }
    },
#+end_src

Initialize key structures in machine context immediately upon creation.

#+begin_src js
    initial: "uninitialized",
    states: {
        uninitialized: {
            entry: [ "initialize" ],
            always: "empty"
        },
#+end_src

After initializing, the interpreter will always start in the "empty" state, because it doesn't have any code to run. It will proceed if it receives some code to run.

The "states" object is left open, because there are many more to define.

#+begin_src js
        empty: {
            on: {
                LOAD_PROGRAM: {
                    target: "run",
                    actions: [ "loadProgram" ]
                }
            }
        },
#+end_src

Once the program is loaded, we are going to be inside "run" until the program finishes or crashes.

The "run" state is complex. It always starts in the sub-state where it checks if the reader head is beyond the edge. This is important because the loaded program might be empty, in which case it should immediately halt.

If the tape is past the edge, then the current tape halts. This tape might have been called by another, indicated by the stack not being empty. Then, this is an implicit return.

If the tape is past the edge but the stack is empty, then the entire program is done.

Otherwise, we proceed to the normal "read" phase.

#+begin_src js
        run: {
            initial: "checkPastTapeEdge",
            states: {
                checkPastTapeEdge: {
                    entry: [ assign((C, E) => { C.steps += 1; if (C.steps > MAX_STEPS) throw new Error("max steps") })],
                    always: [
                        {
                            cond: "isBeyondEdgeAndStackIsNonEmpty",
                            target: "return"
                        },
                        {
                            cond: "isBeyondEdge",
                            target: "#StepwiseInterpreter.halted"
                        },
                        {
                            target: "read"
                        }
                    ]
                },
#+end_src

To interpret a Concrete program is to loop over each cell of the program's tape and take some action. Which action to take depends on which block is in the current cell. We record it before acting on that information to facilitate the intended "step-wise" nature.

At the beginning of the program, the reader head is at the first cell. Later, the program will return to this state but the reader head will have progressed to a different cell.

Upon proceeding, we branch depending on the category of that block.

#+begin_src js
                read: {
                    entry: [ "recordCurrentBlockAtHead", "reportReadyToStep" ],
                    on : {
                        STEP: [
                            {
                                cond: "isCurrentBlockValue",
                                target: "executeValue"
                            },
                            {
                                cond: "isCurrentBlockOp",
                                target: "executeOp"
                            },
                            {
                                actions: [ "reportErrorInvalidCategoryOfCurrentBlock" ],
                                target: "#StepwiseInterpreter.error"
                            }
                        ]
                    }
                },
#+end_src

Ops act on their arguments, or the tape around them. They are the blocks which /do/ things. What happens depends on the block itself, so we have to dispatch based on that block to a variety of executors.

#+begin_src js
                executeOp: {
                    invoke: {
                        id : "executor",
                        src : "dispatchOnExecutor",
                        // data : (C, E) => C,
                        onError : {
                            // Toggle on for executor error loggging
                            // actions: [(C, E) => console.log("Executor Error:", E)],
                            target : "#StepwiseInterpreter.error"
                        },
                        onDone: {
                            target: "advance",
                            actions: [ "clearArguments" ]
                        }
                    },
#+end_src

Op executors can do a huge variety of things during their invocation. All those things are received as events, and handled by this machine.

This first important action is a way to replicate the "onDone" above for those services which do not finalize themselves, like callback services.

#+begin_src js
                    on: {
                        DONE: { target: "advance", actions: [ "clearArguments" ] },
                        DONE_NO_ADVANCE: { target: "no_advance" },
                        EXPLICIT_RETURN: { target: "return" },
                        CLEAR_ARGUMENTS: { actions: [ "clearArguments" ] },
                        CALL_TAPE : { actions: [ "exec_callTape" ] },
                        PLACE_OP_RESULT : { actions: [ "exec_placeResult" ] },
                        PLACE_BLOCK_AT_ADDRESS : { actions: [ "exec_placeBlockAtAddress" ] },
                        MOVE_HEAD_TO_ADDRESS : { actions: [ "exec_moveHeadToAddress" ]},
                        REQUEST_BLOCK_AT_ADDRESS : { actions: [ "exec_reqBlockAtAddress" ] },
                    }
                },
#+end_src

If there is a comma preceding the current block, we grow the argument list by appending the current block. If there is no comma, the argument list will only contain the current block, dumping its previous contents.

#+begin_src js
                executeValue: {
                    entry: [ "reportReadyToStep" ],
                    on : {
                        STEP: [
                            {
                                cond: "isCommaAtHead",
                                target: "advance",
                                actions: [ "appendArgumentsWithCurrentBlock" ]
                            },
                            {
                                target: "advance",
                                actions: [ "replaceArgumentsWithCurrentBlock" ]
                            }
                        ]
                    }
                },
#+end_src

In general, once we've done whatever we're going to do with this block, we move one place to the right. There are exceptions to this, such as if a tape halts or if the head jumps.

After advancing, we go "back to the top" in the read-eval-advance cycle, first checking if we've moved past the edge of the tape and must halt.

#+begin_src js
                advance: {
                    entry: [ "reportReadyToStep" ],
                    on : {
                        STEP: {
                            target: "checkPastTapeEdge",
                            actions: [ "advanceHead" ]
                        }
                    }
                },
#+end_src

For those executors which do not advance the head, we still want the step machine to act the same way, so make the same exact state but which does not advance.

#+begin_src js
                no_advance: {
                    entry: [ "reportReadyToStep" ],
                    on : {
                        STEP: {
                            target: "checkPastTapeEdge",
                        }
                    }
                },
#+end_src

The machine enters the "return" state when a called tape is complete. If the tape has a result, place it where results go. Usually, this is immediately to the right of the call identifier which spawned the tape.

#+begin_src js
                "return" : {
                    entry: [ "reportReadyToStep" ],
                    on : {
                        STEP: {
                            target: "pop",
                            actions: [ "placeResultOnLowerFrame" ]
                        }
                    }
                },
#+end_src

Pop merely disposes of the current frame and replaces it with the frame on top of the stack. Then, it starts back at the top of the loop by checking past the edge for the old frame.

#+begin_src js
                pop : {
                    entry: [ "reportReadyToStep" ],
                    on : {
                        STEP: {
                            target: "advance",
                            actions: [ "popFrame" ]
                        }
                    }
                }
#+end_src

Closing "run" internal states map as well as itself.

#+begin_src js
            }
        },
#+end_src

A program which has completed interpretation normally will find itself, finally, in the "halted" state

When the program is halted, the result of the program is the current arguments list in the active frame.

#+begin_src js
        halted: {
            type : "final",
            entry : [ "haltFrame" ],
            data : (C) => ({ results: C.activeFrame.arguments })
        },
#+end_src

The other way a program can end is in the error state.

When the program errors, we assume it is from an executor, in which case the current event holds all the data about the error which arose.

We include the full context of the machine for debugging purposes.

#+begin_src js
        error: {
            type : "final",
            entry : [ "haltFrame" ],
            data : (C, E) => ({ error: E, context: C })
        },
#+end_src

We're done with states, so close the state map:

#+begin_src js
    },
#+end_src


And finally, close up the definition:

#+begin_src js
};
#+end_src

