src/StepwiseMachine.js

// Begin the definition, we'll explain each state in turn:


// [[file:../literate/StepwiseMachine.org::*Definition][Definition:1]]
export const definition = {
    id: "StepwiseInterpreter",
    strict: true,
// Definition:1 ends here



// At any time until the interpreter finalizes, users can load new global implementations.


// [[file:../literate/StepwiseMachine.org::*Definition][Definition:2]]
    on: {
        LOAD_GLOBAL_LABEL: { actions: [ "loadGlobalLabel" ] }
    },
// Definition:2 ends here



// Initialize key structures in machine context immediately upon creation.


// [[file:../literate/StepwiseMachine.org::*Definition][Definition:3]]
    initial: "uninitialized",
    states: {
        uninitialized: {
            entry: [ "initialize" ],
            always: "empty"
        },
// Definition:3 ends here



// After initializing, the interpreter will always start in the "empty" state, because it doesn't have any code to run. It will proceed if it receives some code to run.

// The "states" object is left open, because there are many more to define.


// [[file:../literate/StepwiseMachine.org::*Definition][Definition:4]]
        empty: {
            on: {
                LOAD_PROGRAM: {
                    target: "run",
                    actions: [ "loadProgram" ]
                }
            }
        },
// Definition:4 ends here



// Once the program is loaded, we are going to be inside "run" until the program finishes or crashes.

// The "run" state is complex. It always starts in the sub-state where it checks if the reader head is beyond the edge. This is important because the loaded program might be empty, in which case it should immediately halt.

// If the tape is past the edge, then the current tape halts. This tape might have been called by another, indicated by the stack not being empty. Then, this is an implicit return.

// If the tape is past the edge but the stack is empty, then the entire program is done.

// Otherwise, we proceed to the normal "read" phase.


// [[file:../literate/StepwiseMachine.org::*Definition][Definition:5]]
        run: {
            initial: "checkPastTapeEdge",
            states: {
                checkPastTapeEdge: {
                    entry: [ assign((C, E) => { C.steps += 1; if (C.steps > MAX_STEPS) throw new Error("max steps") })],
                    always: [
                        {
                            cond: "isBeyondEdgeAndStackIsNonEmpty",
                            target: "return"
                        },
                        {
                            cond: "isBeyondEdge",
                            target: "#StepwiseInterpreter.halted"
                        },
                        {
                            target: "read"
                        }
                    ]
                },
// Definition:5 ends here



// To interpret a Concrete program is to loop over each cell of the program's tape and take some action. Which action to take depends on which block is in the current cell. We record it before acting on that information to facilitate the intended "step-wise" nature.

// At the beginning of the program, the reader head is at the first cell. Later, the program will return to this state but the reader head will have progressed to a different cell.

// Upon proceeding, we branch depending on the category of that block.


// [[file:../literate/StepwiseMachine.org::*Definition][Definition:6]]
                read: {
                    entry: [ "recordCurrentBlockAtHead", "reportReadyToStep" ],
                    on : {
                        STEP: [
                            {
                                cond: "isCurrentBlockValue",
                                target: "executeValue"
                            },
                            {
                                cond: "isCurrentBlockOp",
                                target: "executeOp"
                            },
                            {
                                actions: [ "reportErrorInvalidCategoryOfCurrentBlock" ],
                                target: "#StepwiseInterpreter.error"
                            }
                        ]
                    }
                },
// Definition:6 ends here



// Ops act on their arguments, or the tape around them. They are the blocks which /do/ things. What happens depends on the block itself, so we have to dispatch based on that block to a variety of executors.


// [[file:../literate/StepwiseMachine.org::*Definition][Definition:7]]
                executeOp: {
                    invoke: {
                        id : "executor",
                        src : "dispatchOnExecutor",
                        // data : (C, E) => C,
                        onError : {
                            // Toggle on for executor error loggging
                            // actions: [(C, E) => console.log("Executor Error:", E)],
                            target : "#StepwiseInterpreter.error"
                        },
                        onDone: {
                            target: "advance",
                            actions: [ "clearArguments" ]
                        }
                    },
// Definition:7 ends here



// Op executors can do a huge variety of things during their invocation. All those things are received as events, and handled by this machine.

// This first important action is a way to replicate the "onDone" above for those services which do not finalize themselves, like callback services.


// [[file:../literate/StepwiseMachine.org::*Definition][Definition:8]]
                    on: {
                        DONE: { target: "advance", actions: [ "clearArguments" ] },
                        DONE_NO_ADVANCE: { target: "no_advance" },
                        EXPLICIT_RETURN: { target: "return" },
                        CLEAR_ARGUMENTS: { actions: [ "clearArguments" ] },
                        CALL_TAPE : { actions: [ "exec_callTape" ] },
                        PLACE_OP_RESULT : { actions: [ "exec_placeResult" ] },
                        PLACE_BLOCK_AT_ADDRESS : { actions: [ "exec_placeBlockAtAddress" ] },
                        MOVE_HEAD_TO_ADDRESS : { actions: [ "exec_moveHeadToAddress" ]},
                        REQUEST_BLOCK_AT_ADDRESS : { actions: [ "exec_reqBlockAtAddress" ] },
                    }
                },
// Definition:8 ends here



// If there is a comma preceding the current block, we grow the argument list by appending the current block. If there is no comma, the argument list will only contain the current block, dumping its previous contents.


// [[file:../literate/StepwiseMachine.org::*Definition][Definition:9]]
                executeValue: {
                    entry: [ "reportReadyToStep" ],
                    on : {
                        STEP: [
                            {
                                cond: "isCommaAtHead",
                                target: "advance",
                                actions: [ "appendArgumentsWithCurrentBlock" ]
                            },
                            {
                                target: "advance",
                                actions: [ "replaceArgumentsWithCurrentBlock" ]
                            }
                        ]
                    }
                },
// Definition:9 ends here



// In general, once we've done whatever we're going to do with this block, we move one place to the right. There are exceptions to this, such as if a tape halts or if the head jumps.

// After advancing, we go "back to the top" in the read-eval-advance cycle, first checking if we've moved past the edge of the tape and must halt.


// [[file:../literate/StepwiseMachine.org::*Definition][Definition:10]]
                advance: {
                    entry: [ "reportReadyToStep" ],
                    on : {
                        STEP: {
                            target: "checkPastTapeEdge",
                            actions: [ "advanceHead" ]
                        }
                    }
                },
// Definition:10 ends here



// For those executors which do not advance the head, we still want the step machine to act the same way, so make the same exact state but which does not advance.


// [[file:../literate/StepwiseMachine.org::*Definition][Definition:11]]
                no_advance: {
                    entry: [ "reportReadyToStep" ],
                    on : {
                        STEP: {
                            target: "checkPastTapeEdge",
                        }
                    }
                },
// Definition:11 ends here



// The machine enters the "return" state when a called tape is complete. If the tape has a result, place it where results go. Usually, this is immediately to the right of the call identifier which spawned the tape.


// [[file:../literate/StepwiseMachine.org::*Definition][Definition:12]]
                "return" : {
                    entry: [ "reportReadyToStep" ],
                    on : {
                        STEP: {
                            target: "pop",
                            actions: [ "placeResultOnLowerFrame" ]
                        }
                    }
                },
// Definition:12 ends here



// Pop merely disposes of the current frame and replaces it with the frame on top of the stack. Then, it starts back at the top of the loop by checking past the edge for the old frame.


// [[file:../literate/StepwiseMachine.org::*Definition][Definition:13]]
                pop : {
                    entry: [ "reportReadyToStep" ],
                    on : {
                        STEP: {
                            target: "advance",
                            actions: [ "popFrame" ]
                        }
                    }
                }
// Definition:13 ends here



// Closing "run" internal states map as well as itself.


// [[file:../literate/StepwiseMachine.org::*Definition][Definition:14]]
            }
        },
// Definition:14 ends here



// A program which has completed interpretation normally will find itself, finally, in the "halted" state

// When the program is halted, the result of the program is the current arguments list in the active frame.


// [[file:../literate/StepwiseMachine.org::*Definition][Definition:15]]
        halted: {
            type : "final",
            entry : [ "haltFrame" ],
            data : (C) => ({ results: C.activeFrame.arguments })
        },
// Definition:15 ends here



// The other way a program can end is in the error state.

// When the program errors, we assume it is from an executor, in which case the current event holds all the data about the error which arose.

// We include the full context of the machine for debugging purposes.


// [[file:../literate/StepwiseMachine.org::*Definition][Definition:16]]
        error: {
            type : "final",
            entry : [ "haltFrame" ],
            data : (C, E) => ({ error: E, context: C })
        },
// Definition:16 ends here



// We're done with states, so close the state map:


// [[file:../literate/StepwiseMachine.org::*Definition][Definition:17]]
    },
// Definition:17 ends here




// And finally, close up the definition:


// [[file:../literate/StepwiseMachine.org::*Definition][Definition:18]]
};
// Definition:18 ends here

// Configuration
