literate/StepwiseMachine.org
* Configuration

Start with actions.

#+begin_src js
export const config = {
    actions: {
#+end_src

When the machine starts, its context just an empty object. Fill it with some necessary structures.

#+begin_src js
        initialize : assign((C, E) => {
            C.steps = 0;
            C.globalLabelsToExecutorServices = {};
            C.nextFrameId = 0;
            C.deadFrameIdsToLabelsToClosedCells = {};
        }),
#+end_src

When the program loads, the source is an Abstract Syntax Tree. We need to create an active stack frame for it.

The rest of the stack is empty.

#+begin_src js
        loadProgram: assign((C, E) => {
            C.source = E.source;
            C.activeFrame = Frame(C.nextFrameId++, E.source.tape);
            C.stack = [];
        }),
#+end_src

Determine what is the category of the block at the head of the current cell.

#+begin_src js
        recordCurrentBlockAtHead : assign((C, E) => {
            C.currentBlock = C.activeFrame.getBlockAtHead();
        }),
#+end_src

Depending on the circumstances, we do or do not clear the current argument list before adding the current block. See "executeValue" above.

Either way, if the value is a ValueIdentifier, we have to resolve it to its proper value, but the =Frame= implementation will handle that.

#+begin_src js
        clearArguments: assign((C, E) => {
            C.activeFrame.clearArguments();
        }),
#+end_src

Arguments list can never include ValueIdentifiers, so always resolve them to their true value.

#+begin_src js
        appendArgumentsWithCurrentBlock : assign((C, E) => {
            let block = C.activeFrame.getBlockAtHead();
            if (block.is(Category.Value, "ValueIdentifier")) {
                block = Utils.resolveAndGet(C, block);
            }
            C.activeFrame.appendBlockToArguments(block);
        }),
        replaceArgumentsWithCurrentBlock : assign((C, E) => {
            C.activeFrame.clearArguments();

            let block = C.activeFrame.getBlockAtHead();
            if (block.is(Category.Value, "ValueIdentifier")) {
                block = Utils.resolveAndGet(C, block);
            }
            C.activeFrame.appendBlockToArguments(block);
        }),
#+end_src

Advance the head of the tape one to the right.

#+begin_src js
        advanceHead : assign((C, E) => {
            C.activeFrame.advance();
        }),
#+end_src

When the program ends or the current tape ends, we set the frame to halted.

#+begin_src js
        haltFrame : assign((C, E) => {
            C.activeFrame.halt();
        }),
#+end_src

When the interpreter encounters a run-time error, that is not an exception in the JavaScript run-time. Save an error object without throwing it.

#+begin_src js
        reportErrorInvalidCategoryOfCurrentBlock : assign((C, E) => {
            C.error = new Error("Invalid category of current block");
        }),
#+end_src

Let our parent know when they can safely send a "STEP" event. When our parent wants to successively step through the whole program, this will ensure they don't send too many "STEP" events. When our parent is a step debugger UI, if they don't receive this event in a very short period of time, they could move to a "working" state to show that the UI isn't ready to be stepped forward yet.

#+begin_src js
        reportReadyToStep : sendParent((C, E) => {
            return { type: "READY_TO_STEP" };
        }),
#+end_src

#+begin_src js
        loadGlobalLabel: assign((C, E) => {
            C.globalLabelsToExecutorServices[E.label] = E.service;
        }),
#+end_src

Pop the stack, disposing of the current frame and replacing it with the top of the stack.

Before we dispose of the current frame, close all its references and move any closed cells into their new home, in the interpreter context.

#+begin_src js
        popFrame : assign((C, E) => {
            const labelsToClosedCells = C.activeFrame.closeReferences();

            if (Object.values(labelsToClosedCells).length > 0) {
                C.deadFrameIdsToLabelsToClosedCells[C.activeFrame.id] = labelsToClosedCells;
            }

            C.activeFrame = C.stack.pop();
        }),
#+end_src

Place the result of the current frame on the frame below it. The result of the current frame is just the current arguments list.

For now, we are just placing the /first/ of that argument list. Perhaps in the future, multiple values of that argument list will match to a number of blanks, or multiple values will result in a tape of values.

If the arguments list is empty, do nothing.

#+begin_src js
        placeResultOnLowerFrame : assign((C, E) => {
            const [ result ] = C.activeFrame.arguments;
            if (! result) return;
            const lastFrame = C.stack[C.stack.length - 1];
            lastFrame.placeResult(result);
        }),
#+end_src

There are a huge number of actions that op block executors can take in the course of their invocation. They are all prefixed with `exec_`.

#+begin_src js
        exec_callTape: assign((C, E) => {
            C.stack.push(C.activeFrame);
            C.activeFrame = Frame(C.nextFrameId++, E.tape, E.arguments, C.activeFrame);
        }),
        exec_placeResult: assign((C, E) => {
            C.activeFrame.placeResult(E.block);
        }),
        exec_reqBlockAtAddress : send((C, E) => {
            const block = Utils.resolveAndGet(C, E.address);
            return { type : "RESPONSE_EXECUTOR", block };
        }, { to: "executor" }),
        exec_placeBlockAtAddress : assign((C, E) => {
            C.activeFrame.setBlockByLabel(E.address.identifier, E.block);
        }),
        exec_moveHeadToAddress : assign((C, E) => {
            C.activeFrame.moveHeadToLabel(E.address.identifier);
        }),
#+end_src

Done with actions, now onto guards. Note guards appear in the above machine in "cond" fields. See XState docs for more.

#+begin_src js
    },
    guards: {
#+end_src

Many guards are obvious from the perspective of the machine, we just defer them to other objects.

#+begin_src js
        isBeyondEdge : (C, E) => C.activeFrame.isBeyondEdge(),
        isBeyondEdgeAndStackIsNonEmpty : (C, E) => C.activeFrame.isBeyondEdge() && C.stack.length > 0,
        isCommaAtHead : (C, E) => C.activeFrame.isCommaAtHead(),
#+end_src

We need to check the category of the current block in order to branch execution.

#+begin_src js
        isCurrentBlockValue : (C, E) => C.currentBlock.is(Category.Value),
        isCurrentBlockOp : (C, E) => C.currentBlock.is(Category.Op),
#+end_src

Given the current block, return the executor service that matches it.

First, resolve the identifier to see where it points. If it points to a tape in the machine, then use our callUserTapeExecutorService. callUserTapeExecutorService takes an extra parameter in addition to the context, the resolved tape; this is for convenience, as otherwise it would have to resolve the same block again itself.

If it points to a global, then there must be an executor defined for that global.

Before returning, invoke the service creator with the current context. Because we are using Immer, the service won't be able to edit anything about the context.

#+begin_src js
    },
    services: {
        dispatchOnExecutor : (C, E) => {
            const block = Utils.resolveAndGet(C, C.currentBlock);

            if (block && block.is(Category.Value, "Tape")) {
                return callUserTapeExecutorService(C, block);
            }

            // Resolving went nowhere, so look for globals from current block.
            const { identifier } = C.currentBlock;
            const executor = 
                  C.globalLabelsToExecutorServices[identifier];

            if (! executor) throw new Error(`No executor found for identifier "${identifier}"`);

            return executor(C);
        }
#+end_src

Close final config map.

#+begin_src js
    }
}
#+end_src
