src/StepwiseMachine.js

// Start with actions.


// [[file:../literate/StepwiseMachine.org::*Configuration][Configuration:1]]
export const config = {
    actions: {
// Configuration:1 ends here



// When the machine starts, its context just an empty object. Fill it with some necessary structures.


// [[file:../literate/StepwiseMachine.org::*Configuration][Configuration:2]]
        initialize : assign((C, E) => {
            C.steps = 0;
            C.globalLabelsToExecutorServices = {};
            C.nextFrameId = 0;
            C.deadFrameIdsToLabelsToClosedCells = {};
        }),
// Configuration:2 ends here



// When the program loads, the source is an Abstract Syntax Tree. We need to create an active stack frame for it.

// The rest of the stack is empty.


// [[file:../literate/StepwiseMachine.org::*Configuration][Configuration:3]]
        loadProgram: assign((C, E) => {
            C.source = E.source;
            C.activeFrame = Frame(C.nextFrameId++, E.source.tape);
            C.stack = [];
        }),
// Configuration:3 ends here



// Determine what is the category of the block at the head of the current cell.


// [[file:../literate/StepwiseMachine.org::*Configuration][Configuration:4]]
        recordCurrentBlockAtHead : assign((C, E) => {
            C.currentBlock = C.activeFrame.getBlockAtHead();
        }),
// Configuration:4 ends here



// Depending on the circumstances, we do or do not clear the current argument list before adding the current block. See "executeValue" above.

// Either way, if the value is a ValueIdentifier, we have to resolve it to its proper value, but the =Frame= implementation will handle that.


// [[file:../literate/StepwiseMachine.org::*Configuration][Configuration:5]]
        clearArguments: assign((C, E) => {
            C.activeFrame.clearArguments();
        }),
// Configuration:5 ends here



// Arguments list can never include ValueIdentifiers, so always resolve them to their true value.


// [[file:../literate/StepwiseMachine.org::*Configuration][Configuration:6]]
        appendArgumentsWithCurrentBlock : assign((C, E) => {
            let block = C.activeFrame.getBlockAtHead();
            if (block.is(Category.Value, "ValueIdentifier")) {
                block = Utils.resolveAndGet(C, block);
            }
            C.activeFrame.appendBlockToArguments(block);
        }),
        replaceArgumentsWithCurrentBlock : assign((C, E) => {
            C.activeFrame.clearArguments();

            let block = C.activeFrame.getBlockAtHead();
            if (block.is(Category.Value, "ValueIdentifier")) {
                block = Utils.resolveAndGet(C, block);
            }
            C.activeFrame.appendBlockToArguments(block);
        }),
// Configuration:6 ends here



// Advance the head of the tape one to the right.


// [[file:../literate/StepwiseMachine.org::*Configuration][Configuration:7]]
        advanceHead : assign((C, E) => {
            C.activeFrame.advance();
        }),
// Configuration:7 ends here



// When the program ends or the current tape ends, we set the frame to halted.


// [[file:../literate/StepwiseMachine.org::*Configuration][Configuration:8]]
        haltFrame : assign((C, E) => {
            C.activeFrame.halt();
        }),
// Configuration:8 ends here



// When the interpreter encounters a run-time error, that is not an exception in the JavaScript run-time. Save an error object without throwing it.


// [[file:../literate/StepwiseMachine.org::*Configuration][Configuration:9]]
        reportErrorInvalidCategoryOfCurrentBlock : assign((C, E) => {
            C.error = new Error("Invalid category of current block");
        }),
// Configuration:9 ends here



// Let our parent know when they can safely send a "STEP" event. When our parent wants to successively step through the whole program, this will ensure they don't send too many "STEP" events. When our parent is a step debugger UI, if they don't receive this event in a very short period of time, they could move to a "working" state to show that the UI isn't ready to be stepped forward yet.


// [[file:../literate/StepwiseMachine.org::*Configuration][Configuration:10]]
        reportReadyToStep : sendParent((C, E) => {
            return { type: "READY_TO_STEP" };
        }),
// Configuration:10 ends here

// [[file:../literate/StepwiseMachine.org::*Configuration][Configuration:11]]
        loadGlobalLabel: assign((C, E) => {
            C.globalLabelsToExecutorServices[E.label] = E.service;
        }),
// Configuration:11 ends here



// Pop the stack, disposing of the current frame and replacing it with the top of the stack.

// Before we dispose of the current frame, close all its references and move any closed cells into their new home, in the interpreter context.


// [[file:../literate/StepwiseMachine.org::*Configuration][Configuration:12]]
        popFrame : assign((C, E) => {
            const labelsToClosedCells = C.activeFrame.closeReferences();

            if (Object.values(labelsToClosedCells).length > 0) {
                C.deadFrameIdsToLabelsToClosedCells[C.activeFrame.id] = labelsToClosedCells;
            }

            C.activeFrame = C.stack.pop();
        }),
// Configuration:12 ends here



// Place the result of the current frame on the frame below it. The result of the current frame is just the current arguments list.

// For now, we are just placing the /first/ of that argument list. Perhaps in the future, multiple values of that argument list will match to a number of blanks, or multiple values will result in a tape of values.

// If the arguments list is empty, do nothing.


// [[file:../literate/StepwiseMachine.org::*Configuration][Configuration:13]]
        placeResultOnLowerFrame : assign((C, E) => {
            const [ result ] = C.activeFrame.arguments;
            if (! result) return;
            const lastFrame = C.stack[C.stack.length - 1];
            lastFrame.placeResult(result);
        }),
// Configuration:13 ends here



// There are a huge number of actions that op block executors can take in the course of their invocation. They are all prefixed with `exec_`.


// [[file:../literate/StepwiseMachine.org::*Configuration][Configuration:14]]
        exec_callTape: assign((C, E) => {
            C.stack.push(C.activeFrame);
            C.activeFrame = Frame(C.nextFrameId++, E.tape, E.arguments, C.activeFrame);
        }),
        exec_placeResult: assign((C, E) => {
            C.activeFrame.placeResult(E.block);
        }),
        exec_reqBlockAtAddress : send((C, E) => {
            const block = Utils.resolveAndGet(C, E.address);
            return { type : "RESPONSE_EXECUTOR", block };
        }, { to: "executor" }),
        exec_placeBlockAtAddress : assign((C, E) => {
            C.activeFrame.setBlockByLabel(E.address.identifier, E.block);
        }),
        exec_moveHeadToAddress : assign((C, E) => {
            C.activeFrame.moveHeadToLabel(E.address.identifier);
        }),
// Configuration:14 ends here



// Done with actions, now onto guards. Note guards appear in the above machine in "cond" fields. See XState docs for more.


// [[file:../literate/StepwiseMachine.org::*Configuration][Configuration:15]]
    },
    guards: {
// Configuration:15 ends here



// Many guards are obvious from the perspective of the machine, we just defer them to other objects.


// [[file:../literate/StepwiseMachine.org::*Configuration][Configuration:16]]
        isBeyondEdge : (C, E) => C.activeFrame.isBeyondEdge(),
        isBeyondEdgeAndStackIsNonEmpty : (C, E) => C.activeFrame.isBeyondEdge() && C.stack.length > 0,
        isCommaAtHead : (C, E) => C.activeFrame.isCommaAtHead(),
// Configuration:16 ends here



// We need to check the category of the current block in order to branch execution.


// [[file:../literate/StepwiseMachine.org::*Configuration][Configuration:17]]
        isCurrentBlockValue : (C, E) => C.currentBlock.is(Category.Value),
        isCurrentBlockOp : (C, E) => C.currentBlock.is(Category.Op),
// Configuration:17 ends here



// Given the current block, return the executor service that matches it.

// First, resolve the identifier to see where it points. If it points to a tape in the machine, then use our callUserTapeExecutorService. callUserTapeExecutorService takes an extra parameter in addition to the context, the resolved tape; this is for convenience, as otherwise it would have to resolve the same block again itself.

// If it points to a global, then there must be an executor defined for that global.

// Before returning, invoke the service creator with the current context. Because we are using Immer, the service won't be able to edit anything about the context.


// [[file:../literate/StepwiseMachine.org::*Configuration][Configuration:18]]
    },
    services: {
        dispatchOnExecutor : (C, E) => {
            const block = Utils.resolveAndGet(C, C.currentBlock);

            if (block && block.is(Category.Value, "Tape")) {
                return callUserTapeExecutorService(C, block);
            }

            // Resolving went nowhere, so look for globals from current block.
            const { identifier } = C.currentBlock;
            const executor = 
                  C.globalLabelsToExecutorServices[identifier];

            if (! executor) throw new Error(`No executor found for identifier "${identifier}"`);

            return executor(C);
        }
// Configuration:18 ends here



// Close final config map.


// [[file:../literate/StepwiseMachine.org::*Configuration][Configuration:19]]
    }
}
// Configuration:19 ends here

// Utils
