src/StepwiseMachine.js

// Utilities that will get used in multiple places in the machine context.

// I tried making the machine's context a class with methods, but somewhere in XState internals it converted to a normal object.

// In the future, perhaps all actions will just dispatch to this class, e.g. ={ myAction : XStateImmer.assign((C, E) => { C.x = E.y; }) }=, will just be =[ "myAction" ].forEach((action) => XStateImmer.assign((C, E) => C[action](E))=.


// [[file:../literate/StepwiseMachine.org::*Utils][Utils:1]]
export const Utils = {
// Utils:1 ends here



// Any time we need to determine the location of a label, it will follow the same process. We call this process resolving, and the product a resolution. A resolution is a succinct description of a location in the entire program. The location is either on the stack in a live frame or in a closed cell in the interpreter.


// [[file:../literate/StepwiseMachine.org::*Utils][Utils:2]]
    resolve(C, block, frame, options = { recurse: true }) {
        const { frameId, identifier: label } = block;
        let resolution = { frameId, label };

        // Is this block captured by a frame?
        if (frameId) {
            const labelsToClosedCells =
                C.deadFrameIdsToLabelsToClosedCells[frameId];

            // Is the frame dead and the value closed?
            if (labelsToClosedCells) {
                resolution.type = "closed";
            }
            // The frame is alive and the value is on the stack
            else {
                resolution.type = "stack";
            }
        }
        // This is not a captured value, so must derive from frame.references
        else {
            resolution.frameId = frame.id;
            const reference = frame.references[label];
            if (! reference) throw new Error(`Could not find reference for ${label}`);

            // Local/param values are always on their frame
            if (reference.type == "local" || reference.type == "param") {
                resolution.type = "stack";
            }
            // This is an upvalue
            else {
                const { frameId: referenceFrameId } = reference;
                const labelsToClosedCells =
                    C.deadFrameIdsToLabelsToClosedCells[
                        referenceFrameId];
                
                // Is the frame dead and the value closed?
                if (labelsToClosedCells) {
                    resolution.type = "closed";
                    resolution.frameId = referenceFrameId;
                }
                // The frame is alive and the value is on the stack
                else {
                    resolution.type = "stack";
                    resolution.frameId = referenceFrameId;
                }
            }
        }
// Utils:2 ends here



// Sometimes we want just the location of the given block, and other times we want to find the end block in a possible chain of value references.


// [[file:../literate/StepwiseMachine.org::*Utils][Utils:3]]
        if (options.recurse) {
            block = Utils.getBlock(C, resolution);

            if (block && block.is(Category.Value, "ValueIdentifier")) {
                frame = Utils.getFrameById(C, resolution.frameId);

                resolution = Utils.resolve(C, block, frame, options);
            }
        }

        return resolution;
    },
// Utils:3 ends here



// Get an actual block given a resolution.


// [[file:../literate/StepwiseMachine.org::*Utils][Utils:4]]
    getBlock(C, { type, label, frameId }) {
        if (type == "closed") {
            return C.deadFrameIdsToLabelsToClosedCells[frameId][label];
        }
        else if (type == "stack") {
            const frame = Utils.getFrameById(C, frameId);

            return frame.getBlockByLabel(label);
        }

        throw new Error(`Unable to get block for resolution ${type}-${label}-${frameId}`)
    },
// Utils:4 ends here



// Further utilities using the above.


// [[file:../literate/StepwiseMachine.org::*Utils][Utils:5]]
    resolveAndGet(C, block) {
        return Utils.getBlock(C, Utils.resolve(C, block, C.activeFrame));
    },
// Utils:5 ends here



// Find a frame on the stack by its ID


// [[file:../literate/StepwiseMachine.org::*Utils][Utils:6]]
    getFrameById(C, id) {
        if (C.activeFrame.id == id) return C.activeFrame;

        // ID's are unique, so order shouldn't matter.
        return C.stack.find((frame) => frame.id == id);
    },
// Utils:6 ends here



// Close utils.


// [[file:../literate/StepwiseMachine.org::*Utils][Utils:7]]
}
// Utils:7 ends here

// Initialize

// Start with an empty context.


// [[file:../literate/StepwiseMachine.org::*Initialize][Initialize:1]]
export const init = () => Machine(definition, config).withContext({});
// Initialize:1 ends here
